; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v7 ?v4)
             (pred_5 ?v1 ?v9)
             (pred_1 ?v7 ?v9)
             (pred_4 ?v10 ?v7 )
	     (pred_8 ?v7)
             (pred_7 ?v3)
             (pred_6 ?v1)
             (pred_11 ?v9)
             (pred_9 ?v7)
             (pred_10 ?v1)
             (pred_2 ?v7)
             (pred_12 ))



(:action op_1
:parameters (?v6 ?v11 ?v5 ?v13)
:precondition (and (pred_7 ?v6) (pred_7 ?v11) (pred_6 ?v5) (pred_11 ?v13)
          (pred_3 ?v6 ?v11) (pred_5 ?v5 ?v13)
                   (pred_1 ?v11 ?v13) (pred_8 ?v6) 
                   (pred_9 ?v11) (pred_10 ?v5))
:effect (and  (pred_2 ?v11) (not (pred_9 ?v11))))


(:action op_3
:parameters (?v6 ?v8)
:precondition (and (pred_7 ?v6) (pred_7 ?v8)
               (pred_8 ?v6) (pred_3 ?v6 ?v8) (pred_2 ?v8))
:effect (and (pred_8 ?v8) (not (pred_8 ?v6))))

(:action op_4
:parameters (?v6 ?v5)
:precondition (and (pred_7 ?v6) (pred_6 ?v5) 
                  (pred_8 ?v6) (pred_4 ?v5 ?v6) (pred_12 ))
:effect (and (pred_10 ?v5)
   (not (pred_4 ?v5 ?v6)) (not (pred_12 ))))


(:action op_5
:parameters (?v6 ?v12 ?v2)
:precondition (and (pred_7 ?v6) (pred_6 ?v12) (pred_6 ?v2)
                  (pred_8 ?v6) (pred_10 ?v2) (pred_4 ?v12 ?v6))
:effect (and (pred_10 ?v12) (pred_4 ?v2 ?v6)
        (not (pred_10 ?v2)) (not (pred_4 ?v12 ?v6))))

(:action op_2
:parameters (?v6 ?v5)
:precondition (and (pred_7 ?v6) (pred_6 ?v5) 
                  (pred_8 ?v6) (pred_10 ?v5))
:effect (and (pred_12 ) (pred_4 ?v5 ?v6) (not (pred_10 ?v5)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_12 obj_19 obj_15 obj_04 obj_09 obj_17 obj_16 obj_02 obj_08 obj_05 obj_03 obj_01 obj_11 obj_14 obj_07
    obj_20 obj_18
    obj_13 obj_06
    )

    (:init
       (pred_12)

       (pred_7 obj_10)
       (pred_7 obj_12)
       (pred_7 obj_19)
       (pred_7 obj_15)
       (pred_7 obj_04)
       (pred_7 obj_09)
       (pred_7 obj_17)
       (pred_7 obj_16)
       (pred_7 obj_02)
       (pred_7 obj_08)
       (pred_7 obj_05)
       (pred_7 obj_03)
       (pred_7 obj_01)
       (pred_7 obj_11)
       (pred_7 obj_14)
       (pred_7 obj_07)
       (pred_11 obj_20)
       (pred_11 obj_18)
       (pred_6 obj_13)
       (pred_6 obj_06)

       (pred_3 obj_10 obj_04)
       (pred_3 obj_10 obj_12)
       (pred_3 obj_12 obj_09)
       (pred_3 obj_12 obj_19)
       (pred_3 obj_12 obj_10)
       (pred_3 obj_19 obj_17)
       (pred_3 obj_19 obj_15)
       (pred_3 obj_19 obj_12)
       (pred_3 obj_15 obj_16)
       (pred_3 obj_15 obj_19)
       (pred_3 obj_04 obj_02)
       (pred_3 obj_04 obj_09)
       (pred_3 obj_04 obj_10)
       (pred_3 obj_09 obj_08)
       (pred_3 obj_09 obj_17)
       (pred_3 obj_09 obj_12)
       (pred_3 obj_09 obj_04)
       (pred_3 obj_17 obj_05)
       (pred_3 obj_17 obj_16)
       (pred_3 obj_17 obj_19)
       (pred_3 obj_17 obj_09)
       (pred_3 obj_16 obj_03)
       (pred_3 obj_16 obj_15)
       (pred_3 obj_16 obj_17)
       (pred_3 obj_02 obj_01)
       (pred_3 obj_02 obj_08)
       (pred_3 obj_02 obj_04)
       (pred_3 obj_08 obj_11)
       (pred_3 obj_08 obj_05)
       (pred_3 obj_08 obj_09)
       (pred_3 obj_08 obj_02)
       (pred_3 obj_05 obj_14)
       (pred_3 obj_05 obj_03)
       (pred_3 obj_05 obj_17)
       (pred_3 obj_05 obj_08)
       (pred_3 obj_03 obj_07)
       (pred_3 obj_03 obj_16)
       (pred_3 obj_03 obj_05)
       (pred_3 obj_01 obj_11)
       (pred_3 obj_01 obj_02)
       (pred_3 obj_11 obj_14)
       (pred_3 obj_11 obj_08)
       (pred_3 obj_11 obj_01)
       (pred_3 obj_14 obj_07)
       (pred_3 obj_14 obj_05)
       (pred_3 obj_14 obj_11)
       (pred_3 obj_07 obj_03)
       (pred_3 obj_07 obj_14)
       (pred_9 obj_15)
       (pred_9 obj_16)
       (pred_1  obj_15 obj_20)
       (pred_1  obj_16 obj_18)
       (pred_2 obj_10)
       (pred_2 obj_12)
       (pred_2 obj_19)
       (pred_2 obj_04)
       (pred_2 obj_09)
       (pred_2 obj_17)
       (pred_2 obj_02)
       (pred_2 obj_08)
       (pred_2 obj_05)
       (pred_2 obj_03)
       (pred_2 obj_01)
       (pred_2 obj_11)
       (pred_2 obj_14)
       (pred_2 obj_07)

       (pred_5  obj_13 obj_20)
       (pred_5  obj_06 obj_18)
       (pred_4 obj_13 obj_03)
       (pred_4 obj_06 obj_10)
       (pred_8 obj_07)
    )

    (:goal (and
       (pred_4 obj_13 obj_14)
    ))
(:constraints
  (always (not (pred_8 obj_05)))
)
)

; plan
1. (op_3 obj_07 obj_03)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_03)
   goals met: 0 of 1
2. (op_4 obj_03 obj_13)
   deleted: (pred_4 obj_13 obj_03) (pred_12)
   added: (pred_10 obj_13)
   goals met: 0 of 1
3. (op_3 obj_03 obj_07)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_07)
   goals met: 0 of 1
4. (op_3 obj_07 obj_14)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_14)
   goals met: 0 of 1
5. (op_2 obj_14 obj_13)
   deleted: (pred_10 obj_13)
   added: (pred_12) (pred_4 obj_13 obj_14)
   goals met: 1 of 1
